app/controllers/categories_controller.rb

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Smoothness', '2020-02-24 11:51:14', '2020-02-24 11:51:14')
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

UPDATE `categories` SET `updated_at` = '2020-02-24 11:51:38' WHERE `categories`.`id` = 1
---
  def update
    respond_to do |format|
      if @category.update(category_params)