app/controllers/onomatopoeia_controller.rb

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def new
    unless params[:id].nil?
      @category = Category.find(params[:id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = NULL LIMIT 1
---
  def create
    #binding.pry
    @category = Category.find(onomatopoeium_params[:category_id])

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1
UPDATE `onomatopoeia` SET `description` = '触った感じが粗く滑らかでないさま', `kana` = 'zarazara' WHERE `onomatopoeia`.`id` = 5
---
  def update
    @onomatopoeia = Category.find(onomatopoeium_params[:category_id]).onomatopoeium.where(id:onomatopoeium_params[:id])
    respond_to do |format|
      if @onomatopoeia.update(onomatopoeium_params)