app/controllers/samples_controller.rb

SELECT `samples`.* FROM `samples`
---
    def index
        @samples = Sample.all